---
kind: type
id: T:Autodesk.Revit.DB.Arc
zh: 弧、圆弧
source: html/1f5f541e-9335-aef3-0e75-59eed9ae2221.htm
---
# Autodesk.Revit.DB.Arc

**中文**: 弧、圆弧

A circular arc.

## Syntax (C#)
```csharp
public class Arc : Curve
```

## Remarks
The arc lies in the plane defined by center and normal.